In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science','Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [4]:
# Q1. Write a code to print the data present in the second row of the dataframe, df.

In [5]:
df[:]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [6]:
# Printing the data present in the second row of the DataFrame
second_row = df.iloc[1]
print(second_row)

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [7]:
# Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

ANS =In Pandas, loc and iloc are both used to access data in a DataFrame, but they have some differences:

1.loc:

It is label-based indexing, meaning it selects data based on the labels of rows and columns.
Uses explicit index (row and column labels) for selection.
Syntax: df.loc[row_label, column_label]
Inclusive when slicing ranges.


2.iloc:

It is integer-based indexing, meaning it selects data based on the integer position of rows and columns.
Uses implicit index (position) for selection.
Syntax: df.iloc[row_index, column_index]
Exclusive when slicing ranges.

In [8]:
# Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df 
# then find the output for both new_df.loc[2] and new_df.iloc[2].

# Did you observe any difference in both the outputs? If so then explain it.

In [9]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [10]:
new_df=df.reindex([3,0,1,2])

In [11]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [12]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [13]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

i observe that iloc take inbult indexes 
and loc take named indexes that 

out put of new_df.loc[2]:

     course_name    Big Data
     
     duration              6
     
      Name: 2, dtype: object
      

out put of new_df.loc[2]:

     course_name    Machine Learning
     
     duration                      3
     
     Name: 1, dtype: object

In [2]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [15]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.912537  0.813663  0.030610  0.591997  0.038438  0.374619
2  0.101082  0.218987  0.260462  0.247638  0.637485  0.367248
3  0.903458  0.695012  0.558332  0.514940  0.457112  0.375078
4  0.617577  0.132383  0.524901  0.332878  0.067004  0.621430
5  0.836083  0.049497  0.079359  0.199424  0.979063  0.083297
6  0.862956  0.646296  0.540151  0.607578  0.766045  0.984848

In [16]:
df1.columns

Index(['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'], dtype='object')

In [17]:
df1['column_2'].std()

0.3292416512229185

In [18]:
df1.std()

column_1    0.315261
column_2    0.329242
column_3    0.241472
column_4    0.178676
column_5    0.379749
column_6    0.305344
dtype: float64

In [19]:
# Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the 
# mean of column, column_2.

In [20]:
# Replacing the data in the second row of 'column_2' with a string variable
string_variable = 'Hello'
df1.loc[2, 'column_2'] = string_variable

In [21]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.912537  0.813663  0.030610  0.591997  0.038438  0.374619
2  0.101082     Hello  0.260462  0.247638  0.637485  0.367248
3  0.903458  0.695012  0.558332  0.514940  0.457112  0.375078
4  0.617577  0.132383  0.524901  0.332878  0.067004  0.621430
5  0.836083  0.049497  0.079359  0.199424  0.979063  0.083297
6  0.862956  0.646296  0.540151  0.607578  0.766045  0.984848

In [22]:
#Q6. What do you understand about the windows function in pandas and list the types of windows 
# functions?

ANS = In Pandas, the window function is used in conjunction with DataFrame objects to perform calculations on a sliding window of data. It allows you to apply various functions (such as mean, sum, min, max, etc.) to a specified window of rows in your dataset.

The window function can be applied using rolling(), which creates a rolling window object, or expanding(), which creates an expanding window object.



There are some common types of window functions:

1.Rolling Functions:- These operate on a fixed-size window of data and move through the DataFrame. Examples include:

rolling().mean(): Calculates the rolling mean.

rolling().sum(): Computes the rolling sum.

rolling().min(), rolling().max(): Finds the rolling minimum and maximum values.

rolling().std(), rolling().var(): Calculates the rolling standard deviation and variance.


2.Expanding Functions:- These include cumulative calculations that grow the window size from the beginning to the current row. Examples include:

expanding().mean(): Computes the expanding mean.

expanding().sum(): Calculates the expanding sum.

expanding().min(), expanding().max(): Finds the expanding minimum and maximum values.

EXAMPLES:-

In [23]:
df1['column_1']

1    0.912537
2    0.101082
3    0.903458
4    0.617577
5    0.836083
6    0.862956
Name: column_1, dtype: float64

In [24]:
df1['column_1'].rolling(window=2).mean()

1         NaN
2    0.506809
3    0.502270
4    0.760518
5    0.726830
6    0.849519
Name: column_1, dtype: float64

In [25]:
df1['column_1'].rolling(window=3).max()

1         NaN
2         NaN
3    0.912537
4    0.903458
5    0.903458
6    0.862956
Name: column_1, dtype: float64

In [26]:
df1['column_1'].rolling(window=3).sum()

1         NaN
2         NaN
3    1.917077
4    1.622118
5    2.357118
6    2.316615
Name: column_1, dtype: float64

In [27]:
df1['column_1'].expanding().sum()

1    0.912537
2    1.013619
3    1.917077
4    2.534654
5    3.370737
6    4.233692
Name: column_1, dtype: float64

In [28]:
df1['column_1'].expanding().min()

1    0.912537
2    0.101082
3    0.101082
4    0.101082
5    0.101082
6    0.101082
Name: column_1, dtype: float64

In [29]:
# Q7. Write a code to print only the current month and year at the time of answering this question.

# [Hint: Use pandas.datetime function]

In [30]:
dt=pd.DataFrame({'date':['2023-11-18','2023-11-18','2023-11-18']})

In [31]:
dt

         date
0  2023-11-18
1  2023-11-18
2  2023-11-18

In [32]:
dt.dtypes

date    object
dtype: object

In [33]:
dt['date']=pd.to_datetime(dt['date'])

In [34]:
dt

        date
0 2023-11-18
1 2023-11-18
2 2023-11-18

In [35]:
dt.dtypes

date    datetime64[ns]
dtype: object

In [36]:
dt

        date
0 2023-11-18
1 2023-11-18
2 2023-11-18

In [37]:
dt['month']=dt['date'].dt.month

In [38]:
dt['year']=dt['date'].dt.year

In [39]:
dt

        date  month  year
0 2023-11-18     11  2023
1 2023-11-18     11  2023
2 2023-11-18     11  2023

In [40]:
# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and 
# calculates the difference between them in days, hours, and minutes using Pandas time delta. The 
# program should prompt the user to enter the dates and display the result.

In [41]:
def calculate_time_difference():
    date1 = input("Enter the first date (YYYY-MM-DD): ")
    date2 = input("Enter the second date (YYYY-MM-DD): ")
    
    date1 = pd.to_datetime(date1)
    date2 = pd.to_datetime(date2)
    
    
    time_diff = date2 - date1
    
    print(f"Time difference: {time_diff.days} days, {time_diff.seconds // 3600} hours, {time_diff.seconds % 3600 // 60} minutes")


calculate_time_difference()

Enter the first date (YYYY-MM-DD):  2023-11-17
Enter the second date (YYYY-MM-DD):  2023-11-18

Time difference: 1 days, 0 hours, 0 minutes

In [43]:
# Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified 
# column to a categorical data type. The program should prompt the user to enter the file path, column 
# name, and category order, and then display the sorted data.

In [5]:
import pandas as pd

def convert_to_categorical(file_path, column_name, category_order):
    try:
        
        data = pd.read_csv(file_path)
    except FileNotFoundError:
        print("File not found. Please check the file path.")
        return
    
    try:
        
        data[column_name] = pd.Categorical(data[column_name], categories=category_order, ordered=True)
    except KeyError:
        print("Column name not found in the CSV file.")
        return
    
    
    sorted_data = data.sort_values(by=column_name)
    print("Sorted Data:")
    print(sorted_data)

if __name__ == "__main__":
    file_path = input("Enter the file path of the CSV file: ")
    column_name = input("Enter the column name to convert to categorical: ")
    category_order = input("Enter the category order (comma-separated): ").split(',')

    convert_to_categorical(file_path, column_name, category_order)

Enter the file path of the CSV file:  taxonomy.csv.xls.csv
Enter the column name to convert to categorical:  parent_id
Enter the category order (comma-separated):

Sorted Data:
    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       NaN             Emergency
2        101-02                Emergency Cash       NaN             Emergency
3    0101-02-01             Help Pay for Food       NaN        Emergency Cash
4    0101-02-02       Help Pay for Healthcare       NaN        Emergency Cash
..          ...                           ...       ...                   ...
285  0111-01-07              Workplace Rights       NaN  Advocacy & Legal Aid
286      111-02                     Mediation       NaN                 Legal
287      111-03                        Notary       NaN                 Legal
288      111-04                Representation       NaN                 Legal
289      111-05  Translation & Interpretation       NaN                 Legal

[290 rows x 4 columns]

In [1]:
# Q10. Write a Python program that reads a CSV file containing sales data for different products and 
# visualizes the data using a stacked bar chart to show the sales of each product category over time. The 
# program should prompt the user to enter the file path and display the chart.

In [11]:
import pandas as pd
import matplotlib.pyplot as plt

def visualize_sales_data(file_path):
    try:
        # Read the CSV file
        data = pd.read_csv(file_path)
    except FileNotFoundError:
        print("File not found. Please check the file path.")
        return
    
   
    try:
        
        data['Date'] = pd.to_datetime(data['Date'])
        
        
        grouped_data = data.groupby(['Date', 'Product_Category'])['Sales'].sum().unstack(fill_value=0)
        
       
        grouped_data.plot(kind='bar', stacked=True, figsize=(10, 6))
        plt.xlabel('Date')
        plt.ylabel('Sales')
        plt.title('Sales of Each Product Category Over Time')
        plt.legend(title='Product Category')
        plt.show()
    except KeyError:
        print("Required columns not found in the CSV file.")
        return

if __name__ == "__main__":
    file_path = input("Enter the file path of the CSV file containing sales data: ")
    visualize_sales_data(file_path)

Enter the file path of the CSV file containing sales data:  new_abnormal_orders.csv

Required columns not found in the CSV file.

In [3]:
# Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write 
# a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and 
# displays the results in a table.
# The program should do the following:
#   Prompt the user to enter the file path of the CSV file containing the student dataR
#   Read the CSV file into a Pandas DataFrameR
#   Calculate the mean, median, and mode of the test scores using Pandas toolsR
#   Display the mean, median, and mode in a table.

In [ ]:
def calculate_statistics(file_path):
    try:
        # Read the CSV file
        data = pd.read_csv(file_path)
    except FileNotFoundError:
        print("File not found. Please check the file path.")
        return
    
    
    try:
       
        mean_score = data['Test_Score'].mean()
        median_score = data['Test_Score'].median()
        mode_score = data['Test_Score'].mode()
        
       
        stats_table = pd.DataFrame({
            'Statistic': ['Mean', 'Median', 'Mode'],
            'Score': [mean_score, median_score, mode_score[0] if len(mode_score) > 0 else None]
        })
        print("Statistics of Test Scores:")
        print(stats_table.to_string(index=False)) 
    except KeyError:
        print("Required columns not found in the CSV file.")
        return

if __name__ == "__main__":
    file_path = input("Enter the file path of the CSV file containing student data: ")
    calculate_statistics(file_path)